[
  {
    "title": "General Data Protection Regulation (GDPR)",
    "url": "https://eur-lex.europa.eu/eli/reg/2016/679/oj",
    "articles": [
      {
        "article": "5",
        "paragraphs": [
          {
            "number": 1,
            "text": "Personal data shall be processed lawfully, fairly and in a transparent manner in relation to the data subject."
          },
          {
            "number": 2,
            "text": "Personal data shall be collected for specified, explicit and legitimate purposes and not further processed in a manner that is incompatible with those purposes."
          }
        ]
      },
      {
        "article": "6",
        "paragraphs": [
          {
            "number": 1,
            "text": "Processing shall be lawful only if and to the extent that at least one of the following applies: the data subject has given consent to the processing of their personal data for one or more specific purposes."
          }
        ]
      }
    ]
  },
  {
    "title": "Digital Services Act (DSA)",
    "url": "https://eur-lex.europa.eu/eli/reg/2022/2065/oj",
    "articles": [
      {
        "article": "14",
        "paragraphs": [
          {
            "number": 1,
            "text": "Providers of intermediary services shall act diligently to remove or disable access to illegal content once they become aware of it."
          }
        ]
      },
      {
        "article": "19",
        "paragraphs": [
          {
            "number": 1,
            "text": "Providers of online platforms shall include clear information on any restrictions they impose on the use of their services in their terms and conditions."
          }
        ]
      }
    ]
  },
  {
    "title": "Digital Markets Act (DMA)",
    "url": "https://eur-lex.europa.eu/eli/reg/2022/1925/oj",
    "articles": [
      {
        "article": "6",
        "paragraphs": [
          {
            "number": 1,
            "text": "Gatekeepers shall not restrict business users from offering the same products or services to end users through third-party online intermediation services or through their own direct online sales channels at prices or conditions that are different from those offered through the gatekeeper’s online intermediation services."
          }
        ]
      },
      {
        "article": "7",
        "paragraphs": [
          {
            "number": 1,
            "text": "Gatekeepers shall provide business users access to the data generated by their activities on the platform."
          }
        ]
      }
    ]
  },
  {
    "title": "Data Act",
    "url": "https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:32023R2854",
    "articles": [
      {
        "article": "4",
        "paragraphs": [
          {
            "number": 1,
            "text": "Manufacturers and designers of connected products shall ensure that users can access the data generated by the use of those products."
          }
        ]
      },
      {
        "article": "5",
        "paragraphs": [
          {
            "number": 1,
            "text": "Data holders shall make data available to data recipients under fair, reasonable, and non-discriminatory terms."
          }
        ]
      }
    ]
  },
  {
    "title": "Artificial Intelligence Act (AI Act)",
    "url": "https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:52021PC0206",
    "articles": [
      {
        "article": "3",
        "paragraphs": [
          {
            "number": 1,
            "text": "An 'artificial intelligence system' (AI system) means software developed with machine learning approaches, logic- and knowledge-based approaches, or statistical approaches that can, for a given set of human-defined objectives, generate outputs such as content, predictions, recommendations, or decisions influencing the environments they interact with."
          }
        ]
      },
      {
        "article": "5",
        "paragraphs": [
          {
            "number": 1,
            "text": "The use of AI systems that deploy subliminal techniques beyond a person's consciousness in order to materially distort a person's behavior in a manner that causes or is likely to cause harm shall be prohibited."
          }
        ]
      }
    ]
  },
  {
    "title": "NIS2 Directive",
    "url": "https://eur-lex.europa.eu/eli/dir/2022/2555/oj",
    "articles": [
      {
        "article": "21",
        "paragraphs": [
          {
            "number": 1,
            "text": "Member States shall ensure that essential and important entities take appropriate and proportionate technical, operational, and organizational measures to manage the risks posed to the security of network and information systems which those entities use in the provision of their services."
          }
        ]
      },
      {
        "article": "23",
        "paragraphs": [
          {
            "number": 1,
            "text": "Entities shall notify, without undue delay, any incident having a significant impact on the provision of their services to the competent authorities or CSIRTs."
          }
        ]
      }
    ]
  },
  {
    "title": "Open Data Directive",
    "url": "https://eur-lex.europa.eu/eli/dir/2019/1024/oj",
    "articles": [
      {
        "article": "5",
        "paragraphs": [
          {
            "number": 1,
            "text": "Documents shall be made available in any pre-existing format or language, through electronic means where possible and appropriate."
          }
        ]
      },
      {
        "article": "6",
        "paragraphs": [
          {
            "number": 1,
            "text": "The re-use of documents shall not be subject to conditions, unless such conditions are objective, proportionate, non-discriminatory, and justified on grounds of public interest."
          }
        ]
      }
    ]
  },
  {
    "title": "ePrivacy Directive",
    "url": "https://eur-lex.europa.eu/eli/dir/2002/58/oj",
    "articles": [
      {
        "article": "5",
        "paragraphs": [
          {
            "number": 1,
            "text": "Member States shall ensure the confidentiality of communications and related traffic data by means of a public communications network and publicly available electronic communications services."
          }
        ]
      },
      {
        "article": "6",
        "paragraphs": [
          {
            "number": 1,
            "text": "Traffic data relating to subscribers and users processed and stored by the provider must be erased or made anonymous when it is no longer needed for the purpose of the transmission of a communication."
          }
        ]
      }
    ]
  }
]
