[
  {
    "title": "General Data Protection Regulation (GDPR)",
    "url": "https://eur-lex.europa.eu/eli/reg/2016/679/oj",
    "recitals": [
      {
        "number": 1,
        "text": "The protection of natural persons in relation to the processing of personal data is a fundamental right."
      },
      {
        "number": 2,
        "text": "The principles of, and rules on the protection of natural persons with regard to the processing of their personal data should, whatever their nationality or residence, respect their fundamental rights and freedoms."
      },
      {
        "number": 3,
        "text": "Directive 95/46/EC of the European Parliament and of the Council seeks to harmonise the protection of fundamental rights and freedoms of natural persons in respect of processing activities and to ensure the free flow of personal data between Member States."
      }
    ],
    "articles": [
      {
        "article": "5",
        "paragraphs": [
          {
            "number": 1,
            "text": "Personal data shall be processed lawfully, fairly and in a transparent manner in relation to the data subject (‘lawfulness, fairness and transparency’); collected for specified, explicit and legitimate purposes and not further processed in a manner that is incompatible with those purposes (‘purpose limitation’); adequate, relevant and limited to what is necessary in relation to the purposes for which they are processed (‘data minimisation’); accurate and, where necessary, kept up to date (‘accuracy’); kept in a form which permits identification of data subjects for no longer than is necessary (‘storage limitation’); processed in a manner that ensures appropriate security of the personal data (‘integrity and confidentiality’)."
          },
          {
            "number": 2,
            "text": "The controller shall be responsible for, and be able to demonstrate compliance with, paragraph 1 (‘accountability’)."
          }
        ]
      },
      {
        "article": "6",
        "paragraphs": [
          {
            "number": 1,
            "text": "Processing shall be lawful only if and to the extent that at least one of the following applies: the data subject has given consent; processing is necessary for the performance of a contract; for compliance with a legal obligation; to protect vital interests; for the performance of a task carried out in the public interest or in the exercise of official authority; or for the purposes of legitimate interests."
          }
        ]
      }
    ]
  }
    ,
  {
    "title": "Artificial Intelligence Act (AI Act)",
    "url": "https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:52021PC0206",
    "recitals": [
      {
        "number": 1,
        "text": "Artificial intelligence is a fast-evolving family of technologies that can contribute to a wide array of economic and societal benefits across the entire spectrum of industries and social activities."
      },
      {
        "number": 2,
        "text": "The use of AI should remain a tool at the service of people with the ultimate aim of increasing human well-being."
      },
      {
        "number": 3,
        "text": "To ensure a high level of protection of public interests such as health, safety and fundamental rights, it is necessary to lay down a uniform legal framework, in particular for high-risk AI systems."
      }
    ],
    "articles": [
      {
        "article": "3",
        "paragraphs": [
          {
            "number": 1,
            "text": "‘Artificial intelligence system’ (AI system) means software that is developed with one or more of the techniques and approaches listed in Annex I and that can, for a given set of human-defined objectives, generate outputs such as content, predictions, recommendations or decisions influencing the environments they interact with."
          }
        ]
      },
      {
        "article": "5",
        "paragraphs": [
          {
            "number": 1,
            "text": "The following AI practices shall be prohibited: (a) the use of subliminal techniques beyond a person’s consciousness; (b) exploitation of vulnerable groups; (c) social scoring by public authorities; (d) real-time remote biometric identification in publicly accessible spaces."
          }
        ]
      }
    ]
  }
    ,
  {
    "title": "Data Act",
    "url": "https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:32023R2854",
    "recitals": [
      {
        "number": 1,
        "text": "Data is at the centre of the digital transformation and is increasingly being used to improve decision-making and innovation."
      },
      {
        "number": 2,
        "text": "The aim of this Regulation is to ensure fairness in the allocation of value from data among actors in the data economy."
      },
      {
        "number": 3,
        "text": "It is necessary to lay down harmonised rules on making data generated by the use of a product or related service accessible to the user."
      }
    ],
    "articles": [
      {
        "article": "4",
        "paragraphs": [
          {
            "number": 1,
            "text": "Manufacturers and designers of connected products shall design and manufacture the products in such a manner that the data generated by their use are, by default, easily accessible to the user."
          }
        ]
      },
      {
        "article": "5",
        "paragraphs": [
          {
            "number": 1,
            "text": "Data holders shall make data available to data recipients under fair, reasonable and non-discriminatory terms and in a transparent manner."
          }
        ]
      }
    ]
  }
  ,
  {
    "title": "Digital Services Act (DSA)",
    "url": "https://eur-lex.europa.eu/eli/reg/2022/2065/oj",
    "recitals": [
      {
        "number": 1,
        "text": "Digital services in the Union have become an important part of the daily lives of users and offer significant economic opportunities for companies and new ways to communicate and transact."
      },
      {
        "number": 2,
        "text": "To ensure a safe, predictable and trustworthy online environment, it is necessary to lay down clear rules for the responsibilities of providers of intermediary services."
      },
      {
        "number": 3,
        "text": "The rules should contribute to the proper functioning of the internal market for intermediary services."
      }
    ],
    "articles": [
      {
        "article": "12",
        "paragraphs": [
          {
            "number": 1,
            "text": "Providers of intermediary services shall not be liable for the information stored at the request of a recipient of the service, on condition that they do not have actual knowledge of illegal activity or information and are not aware of facts or circumstances from which the illegal activity or information is apparent."
          }
        ]
      },
      {
        "article": "14",
        "paragraphs": [
          {
            "number": 1,
            "text": "Providers of online platforms shall put in place mechanisms to allow users to flag content they consider to be illegal."
          }
        ]
      }
    ]
  }
  ,
  {
    "title": "Digital Markets Act (DMA)",
    "url": "https://eur-lex.europa.eu/eli/reg/2022/1925/oj",
    "recitals": [
      {
        "number": 1,
        "text": "The digital sector is characterized by the presence of platforms acting as gatekeepers between business users and consumers."
      },
      {
        "number": 2,
        "text": "A small number of large platforms increasingly determine the parameters for future innovation, consumer choice and competition."
      },
      {
        "number": 3,
        "text": "To address unfair practices by gatekeepers and ensure contestable and fair markets, targeted regulation is necessary."
      }
    ],
    "articles": [
      {
        "article": "3",
        "paragraphs": [
          {
            "number": 1,
            "text": "A provider of core platform services shall be designated as a gatekeeper if it has a significant impact on the internal market, operates a core platform service which serves as an important gateway for business users to reach end users, and enjoys an entrenched and durable position."
          }
        ]
      },
      {
        "article": "5",
        "paragraphs": [
          {
            "number": 1,
            "text": "Gatekeepers shall not combine personal data from different core platform services without effective consent, nor prevent business users from offering different conditions through other channels."
          }
        ]
      }
    ]
  }
  ,
  {
    "title": "NIS2 Directive",
    "url": "https://eur-lex.europa.eu/eli/dir/2022/2555/oj",
    "recitals": [
      {
        "number": 1,
        "text": "The functioning of the internal market is increasingly dependent on network and information systems, and incidents affecting them can hinder economic activities and cause substantial societal and economic damage."
      },
      {
        "number": 2,
        "text": "To address growing cyber threats and strengthen the level of cybersecurity, it is necessary to improve the resilience and incident response capacities of both the public and private sectors."
      },
      {
        "number": 3,
        "text": "This Directive lays down measures to achieve a high common level of cybersecurity across the Union."
      }
    ],
    "articles": [
      {
        "article": "3",
        "paragraphs": [
          {
            "number": 1,
            "text": "Each Member State shall adopt a national cybersecurity strategy that defines the strategic objectives and appropriate policy and regulatory measures to achieve and maintain a high level of cybersecurity."
          }
        ]
      },
      {
        "article": "5",
        "paragraphs": [
          {
            "number": 1,
            "text": "Entities identified as essential or important shall take appropriate and proportionate technical, operational and organisational measures to manage the risks posed to the security of network and information systems."
          }
        ]
      }
    ]
  }
  ,
  {
    "title": "ePrivacy Directive",
    "url": "https://eur-lex.europa.eu/eli/dir/2002/58/oj",
    "recitals": [
      {
        "number": 1,
        "text": "The development of new advanced digital technologies requires specific protection of privacy and personal data in the electronic communications sector."
      },
      {
        "number": 2,
        "text": "Confidentiality of communications is a fundamental right, and Member States must ensure that the confidentiality of communications and the related traffic data is guaranteed."
      },
      {
        "number": 3,
        "text": "Terminal equipment of users of electronic communications networks and any information stored on such equipment are part of the private sphere of the users requiring protection under the European Convention for the Protection of Human Rights and Fundamental Freedoms."
      }
    ],
    "articles": [
      {
        "article": "5",
        "paragraphs": [
          {
            "number": 1,
            "text": "Member States shall ensure the confidentiality of communications and the related traffic data by means of a public communications network and publicly available electronic communications services."
          }
        ]
      },
      {
        "article": "6",
        "paragraphs": [
          {
            "number": 1,
            "text": "Traffic data relating to subscribers and users processed and stored by the provider must be erased or made anonymous when it is no longer needed for the purpose of the transmission of a communication, without prejudice to paragraph 2 and Articles 15 and 16."
          }
        ]
      }
    ]
  }
  ,
  {
    "title": "Open Data Directive",
    "url": "https://eur-lex.europa.eu/eli/dir/2019/1024/oj",
    "recitals": [
      {
        "number": 1,
        "text": "Public sector information is an important source of content and digital innovation, and access to it can contribute to the development of digital services and applications."
      },
      {
        "number": 2,
        "text": "The Directive aims to increase the amount of public sector data available for re-use and enhance the value of open data for the economy and society."
      },
      {
        "number": 3,
        "text": "The re-use of public sector information should not lead to restrictions of competition, and it must be non-discriminatory and fair."
      }
    ],
    "articles": [
      {
        "article": "5",
        "paragraphs": [
          {
            "number": 1,
            "text": "Documents shall be re-usable for commercial or non-commercial purposes in accordance with the conditions set out in this Directive."
          }
        ]
      },
      {
        "article": "6",
        "paragraphs": [
          {
            "number": 1,
            "text": "Public sector bodies shall make documents available in any pre-existing format or language, where possible and appropriate, by electronic means in formats that are open, machine-readable, accessible, and re-usable, together with their metadata."
          }
        ]
      }
    ]
  }

  ,
  {
    "title": "Consumer Protection Cooperation Regulation",
    "url": "https://eur-lex.europa.eu/eli/reg/2017/2394/oj",
    "recitals": [
      {
        "number": 1,
        "text": "Ensuring a high level of consumer protection in the internal market requires effective enforcement of Union legislation on consumer protection."
      },
      {
        "number": 2,
        "text": "Consumer rights are at risk if competent authorities do not cooperate effectively across borders in tackling widespread infringements."
      },
      {
        "number": 3,
        "text": "This Regulation lays down the conditions under which national authorities and the Commission shall cooperate and coordinate enforcement actions."
      }
    ],
    "articles": [
      {
        "article": "6",
        "paragraphs": [
          {
            "number": 1,
            "text": "Competent authorities shall have the power to investigate, take enforcement measures and coordinate actions to address cross-border infringements of consumer protection laws."
          }
        ]
      },
      {
        "article": "8",
        "paragraphs": [
          {
            "number": 1,
            "text": "Authorities may request information from any public authority, natural or legal person for the purposes of investigating and enforcing compliance with Union consumer protection rules."
          }
        ]
      }
    ]
  }

]
